Обработки/Reports/_РасшифровкаИнформацииОКредитныхРейтингах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасшифровкаИнформацииОКредитныхРейтингах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасшифровкаИнформацииОКредитныхРейтингах/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Расшифровка информации о кредитных рейтинга",
		"0.04",
		"",
		Истина,
		);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции    

Функция ПолучитьТаблицуПоказателей(ВидДеятельности)
	
	Макет = ПолучитьМакет("Показатели"); 
	
	Показатели = Новый ТаблицаЗначений; 
	Показатели.Колонки.Добавить("Код",  Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(2)));
	Показатели.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
	Показатели.Колонки.Добавить("Родитель", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(2)));
	
	ОбластьДанные = Макет.ПолучитьОбласть("Данные" + ВидДеятельности + "|Колонки");
	
	КоличествоСтрок = ОбластьДанные.ВысотаТаблицы;
	
	Для индСтроки = 1 по КоличествоСтрок Цикл
		НоваяСтрока = Показатели.Добавить();
		Для индКолонки = 1 по 3 Цикл  
			ТекстЯчейки = ОбластьДанные.ПолучитьОбласть(индСтроки, индКолонки).ТекущаяОбласть.Текст;   
			НоваяСтрока[индКолонки-1] = ТекстЯчейки;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Показатели;
	
КонецФункции

Функция ПолучитьТаблицуПримечаний(ВидДеятельности) 
	
	Макет = ПолучитьМакет("Показатели"); 
	
	Примечания = Новый ТаблицаЗначений; 
	Примечания.Колонки.Добавить("Код",  Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(2)));
	Примечания.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(300)));
	Примечания.Колонки.Добавить("НомерПримечания", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(20)));
	
	ОбластьДанные = Макет.ПолучитьОбласть("Разделы|КолонкиРазделы");
	
	КоличествоСтрок = ОбластьДанные.ВысотаТаблицы;
	
	Для индСтроки = 1 по КоличествоСтрок Цикл
		НоваяСтрока = Примечания.Добавить();
		Для индКолонки = 1 по 4 Цикл
			ТекстЯчейки = ОбластьДанные.ПолучитьОбласть(индСтроки, индКолонки).ТекущаяОбласть.Текст;
			Если индКолонки < 3 Тогда 
				НоваяСтрока[индКолонки-1] = ТекстЯчейки; 
			ИначеЕсли индКолонки = 3 И ВидДеятельности = "НПФ" Тогда
				НоваяСтрока[индКолонки-1] = ТекстЯчейки; 
				Прервать;  
			ИначеЕсли индКолонки = 3 И ВидДеятельности = "СК" Тогда
				Продолжить;
			ИначеЕсли индКолонки = 4 И ВидДеятельности = "СК" Тогда
				НоваяСтрока[индКолонки-2] = ТекстЯчейки; 
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Примечания;
	
КонецФункции

Функция ПолучитьТаблицуРазделаКредитныхРейтингов(НастройкиОтчета, ТаблицаПоказателей, РасшифровкаНастроек, ТаблицаПримечаний)
	
	РасшифровкаНастроек = Новый ТаблицаЗначений;
	РасшифровкаНастроек.Колонки.Добавить("НастройкаОтчета");
	РасшифровкаНастроек.Колонки.Добавить("ЗначениеНастройки");
	РасшифровкаНастроек.Колонки.Добавить("СтрокаОтчета");
	РасшифровкаНастроек.Колонки.Добавить("ВидДепозита");
	
	Запрос = Новый Запрос;  
	
	// имитация переменной СтруктураРеквизитовФормы
	Параметры = Новый Структура;
	Параметры.Вставить("мДатаНачалаПериодаОтчета",				НачалоГода(ЭтотОбъект.Период));
	Параметры.Вставить("мДатаКонцаПериодаОтчета",				КонецДня(ЭтотОбъект.Период));
	Параметры.Вставить("мДатаНачалаПрошлогоПериодаОтчета",		ДобавитьМесяц(НачалоГода(ЭтотОбъект.Период), -12)); // не важно. Данные за прошлый год не нужны
	Параметры.Вставить("мДатаКонцаПрошлогоПериодаОтчета",  		ДобавитьМесяц(КонецДня(ЭтотОбъект.Период), -12)); // добавил для вызова ф-ции  ПолучитьДепозитныеВклады() 
	Параметры.Вставить("СчетДоверительногоУправления", 			ЭтотОбъект.СчетДоверительногоУправления);
	
	Запрос.УстановитьПараметр("ДатаРейтинга"				, КонецДня(ЭтотОбъект.Период));
	Запрос.УстановитьПараметр("КонтрагентНКЦ"				, ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"));
	Запрос.УстановитьПараметр("ДепозитыКраткосрочные"		, КонсолидированнаяОтчетность.ПолучитьДепозитныеВклады(НастройкиОтчета, Параметры, ,"Краткосрочные")); 
	Запрос.УстановитьПараметр("ПереходНаМСФО9"				, Ложь); // СтруктураРеквизитовФормы.ПереходНаМСФО9);
	// на конец 2024 года ПереходНаМСФО9 = Истина, возьмем первый документ 2025
	// во всех остальных случаях ПереходНаМСФО9 = Ложь 
	
	Запрос.УстановитьПараметр("КонецПериода"            	, КонецДня(ЭтотОбъект.Период));
	Запрос.УстановитьПараметр("грКонецПериода"            	, Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация"					, ЭтотОбъект.Организация); 
	Запрос.УстановитьПараметр("ВалютаУчета"					, ЭтотОбъект.Организация.ВалютаУчета);

	
	
	Если НастройкиОтчета.ВидДеятельностиОрганизации.Ключ = "СК" Тогда
		
		СтрокаДенежныеСредства = 					"03";
		СтрокаДСПрочие = 							"04";
		СтрокаДолговыеПоСС = 						"06";
		СтрокаДепозитыПоСС = 						"07";
		СтрокаДепозитыПоАС = 						"12";
		СтрокаСделкиРЕПОсЦК = 						"13";
		СтрокаДолговыеПоАсКредитныеОрганизации = 	"11"; 
		СтрокаПрочиеСредстваВКредитныхОрганизациях ="14";
		СтрокаДолговыеПоАсПрочие = 					"16";
		СтрокаСделкиРЕПОПрочие = 					"18";
		СтрокаПрочие = 								"23";
		СтрокаДебиторскаяЗадолженность = 			"19";

	Иначе	

		СтрокаДенежныеСредства = 					"03";
		СтрокаДСПрочие = 							"04";
		СтрокаДолговыеПоСС = 						"06";
		СтрокаДепозитыПоСС = 						"07"; 
		СтрокаДепозитыПоАС = 						"10";
		СтрокаСделкиРЕПОсЦК = 						"11";
		СтрокаДолговыеПоАсКредитныеОрганизации = 	"12"; 
		СтрокаПрочиеСредстваВКредитныхОрганизациях ="13";
		СтрокаДолговыеПоАсПрочие = 					"15";
		СтрокаСделкиРЕПОПрочие = 					"16";
		СтрокаПрочие = 								"19";
		СтрокаДебиторскаяЗадолженность = 			"17";
		
	КонецЕсли;

	Запрос.УстановитьПараметр("ТаблицаПоказателей", ТаблицаПоказателей);   
	Запрос.УстановитьПараметр("ТаблицаПримечаний", ТаблицаПримечаний);   
	 	
	Запрос.УстановитьПараметр("СтрокаДенежныеСредства", 					СтрокаДенежныеСредства);
	Запрос.УстановитьПараметр("СтрокаДолговыеПоСС", 						СтрокаДолговыеПоСС);
	Запрос.УстановитьПараметр("СтрокаДепозитыПоСС", 						СтрокаДепозитыПоСС);
	Запрос.УстановитьПараметр("СтрокаДепозитыПоАС", 						СтрокаДепозитыПоАС);
	Запрос.УстановитьПараметр("СтрокаСделкиРЕПОсЦК", 						СтрокаСделкиРЕПОсЦК);
	Запрос.УстановитьПараметр("СтрокаСделкиРЕПОПрочие", 					СтрокаСделкиРЕПОПрочие);
	Запрос.УстановитьПараметр("СтрокаДолговыеПоАсКредитныеОрганизации", 	СтрокаДолговыеПоАсКредитныеОрганизации); 
	Запрос.УстановитьПараметр("СтрокаДолговыеПоАсПрочие", 					СтрокаДолговыеПоАсПрочие);
	Запрос.УстановитьПараметр("СтрокаДебиторскаяЗадолженность", 			СтрокаДебиторскаяЗадолженность);
	
	Если ?(НастройкиОтчета.УчитыватьБрокерскиеСчетаВДебиторке = Неопределено, ЛОЖЬ, НастройкиОтчета.УчитыватьБрокерскиеСчетаВДебиторке) Тогда 
		СтрокаДСБрокер = СтрокаПрочие;
		ДобавитьСтрокуВРасшифровкуНастроек(РасшифровкаНастроек, "Учитывать брокерские счета в дебиторской задолженности", НастройкиОтчета.УчитыватьБрокерскиеСчетаВДебиторке, СтрокаДСБрокер); 
		ДобавитьСтрокуВРасшифровкуНастроек(РасшифровкаНастроек, "Учитывать остатки по брокерским счетам в составе ДС", НастройкиОтчета.УчитыватьБрокерскиеСчетаВДебиторке, "");
	Иначе
		Если ?(НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС = Неопределено, ЛОЖЬ, НастройкиОтчета.УчитыватьБрокерскиеСчетаВДС) Тогда
			СтрокаДСБрокер = СтрокаДСПрочие;
		Иначе
			СтрокаДСБрокер = СтрокаПрочиеСредстваВКредитныхОрганизациях;
		КонецЕсли;
		ДобавитьСтрокуВРасшифровкуНастроек(РасшифровкаНастроек, "Учитывать брокерские счета в дебиторской задолженности", НастройкиОтчета.УчитыватьБрокерскиеСчетаВДебиторке, ""); 
		ДобавитьСтрокуВРасшифровкуНастроек(РасшифровкаНастроек, "Учитывать остатки по брокерским счетам в составе ДС", НастройкиОтчета.УчитыватьБрокерскиеСчетаВДебиторке, СтрокаДСБрокер);
	КонецЕсли;	
	Запрос.УстановитьПараметр("СтрокаДСБрокер", СтрокаДСБрокер);
	
	Если ?(НастройкиОтчета.УчитыватьКлиринговыеСчетаВДС = Неопределено, ЛОЖЬ, НастройкиОтчета.УчитыватьКлиринговыеСчетаВДС) Тогда
		СтрокаДСКлиринг = СтрокаДСПрочие;
	Иначе
		СтрокаДСКлиринг = СтрокаПрочиеСредстваВКредитныхОрганизациях;
	КонецЕсли;
	Запрос.УстановитьПараметр("СтрокаДСКлиринг", СтрокаДСКлиринг);
	ДобавитьСтрокуВРасшифровкуНастроек(РасшифровкаНастроек, "Учитывать остатки по клиринговым счетам в составе ДС", НастройкиОтчета.УчитыватьКлиринговыеСчетаВДС, СтрокаДСКлиринг);
	
	Если НастройкиОтчета.НеУчитыватьПроцентыМНОВДС = Неопределено ИЛИ НЕ НастройкиОтчета.НеУчитыватьПроцентыМНОВДС Тогда
		СтрокаМНО = СтрокаДенежныеСредства;
	Иначе	
		СтрокаМНО = СтрокаДепозитыПоАС;
	КонецЕсли;
	Запрос.УстановитьПараметр("СтрокаМНО", СтрокаМНО);
	ДобавитьСтрокуВРасшифровкуНастроек(РасшифровкаНастроек, "Не учитывать % по МНО в составе денежных средств", НастройкиОтчета.НеУчитыватьПроцентыМНОВДС, СтрокаМНО);
		
	Если НастройкиОтчета.НеУчитыватьПроцентыПоДепозитамВДС = Неопределено ИЛИ НЕ НастройкиОтчета.НеУчитыватьПроцентыПоДепозитамВДС Тогда
		Запрос.УстановитьПараметр("ПроцентыПоДепозитамВДС", Истина); 
		СтрокаПроцентыПоДепозитам = СтрокаДенежныеСредства;	
	Иначе	
		Запрос.УстановитьПараметр("ПроцентыПоДепозитамВДС", Ложь); 
		СтрокаПроцентыПоДепозитам = СтрокаДепозитыПоАС + ", " + СтрокаДепозитыПоСС;
	КонецЕсли; 
	ДобавитьСтрокуВРасшифровкуНастроек(РасшифровкаНастроек, "Не учитывать % по депозитам в составе денежных средств", НастройкиОтчета.НеУчитыватьПроцентыПоДепозитамВДС, СтрокаПроцентыПоДепозитам, "Краткосрочный");
	ДобавитьСтрокуВРасшифровкуНастроек(РасшифровкаНастроек, "Не учитывать % по депозитам в составе денежных средств", НастройкиОтчета.НеУчитыватьПроцентыПоДепозитамВДС, СтрокаДепозитыПоАС + ", " + СтрокаДепозитыПоСС, "Долгосрочный");
		
	РаботаСОтчетами.ПолучитьДанныеДляИнформацииПоКредитнымРейтингам(Запрос);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаПоказателей.Код КАК Код,
	|	ТаблицаПоказателей.Наименование КАК Наименование,
	|	ТаблицаПоказателей.Родитель КАК Родитель
	|ПОМЕСТИТЬ _ТаблицаПоказателей
	|ИЗ
	|	&ТаблицаПоказателей КАК ТаблицаПоказателей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаПримечаний.Код КАК Код,
	|	ТаблицаПримечаний.Наименование КАК Наименование,
	|	ТаблицаПримечаний.НомерПримечания КАК НомерПримечания
	|ПОМЕСТИТЬ _ТаблицаПримечаний
	|ИЗ
	|	&ТаблицаПримечаний КАК ТаблицаПримечаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	_ТаблицаОтчета.НомерСтроки КАК НомерСтроки,
	|	_ТаблицаПоказателей.Наименование КАК Наименование,
	|	_ТаблицаПоказателей.Родитель КАК РодительНомерСтроки,
	|	_ТаблицаПоказателейРодитель.Наименование КАК РодительНаименование,
	|	_ТаблицаОтчета.Актив КАК Актив,
	|	_ТаблицаОтчета.Тип КАК Тип,
	|	_ТаблицаОтчета.СтадияОбесценения КАК СтадияОбесценения,
	|	_ТаблицаОтчета.СтрокаСопоставления КАК СтрокаСопоставления,
	|	ВЫБОР
	|		КОГДА _ТаблицаОтчета.СтрокаСопоставления = 1
	|			ТОГДА _ТаблицаОтчета.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРейтингА,
	|	ВЫБОР
	|		КОГДА _ТаблицаОтчета.СтрокаСопоставления = 2
	|			ТОГДА _ТаблицаОтчета.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРейтингБ,
	|	ВЫБОР
	|		КОГДА _ТаблицаОтчета.СтрокаСопоставления = 3
	|			ТОГДА _ТаблицаОтчета.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРейтингЦ,
	|	ВЫБОР
	|		КОГДА _ТаблицаОтчета.СтрокаСопоставления = 4
	|			ТОГДА _ТаблицаОтчета.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРейтингД,
	|	ВЫБОР
	|		КОГДА _ТаблицаОтчета.СтрокаСопоставления = 5
	|			ТОГДА _ТаблицаОтчета.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаБезРейтинга,
	|	_ТаблицаОтчета.ЗначениеРейтинга КАК ЗначениеРейтинга,
	|	_ТаблицаОтчета.РейтинговоеАгентство КАК РейтинговоеАгентство,
	|	_ТаблицаПримечаний.Код КАК Раздел,
	|	_ТаблицаПримечаний.Наименование КАК НаименованиеРаздела,
	|	_ТаблицаПримечаний.НомерПримечания КАК НомерПримечания
	|ИЗ
	|	_ТаблицаПримечаний КАК _ТаблицаПримечаний
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаОтчета КАК _ТаблицаОтчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаПоказателей КАК _ТаблицаПоказателей
	|				ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаПоказателей КАК _ТаблицаПоказателейРодитель
	|				ПО _ТаблицаПоказателей.Код = _ТаблицаПоказателейРодитель.Код
	|			ПО (_ТаблицаПоказателей.Код = _ТаблицаОтчета.НомерСтроки)
	|		ПО (_ТаблицаПримечаний.Код = ВЫБОР
	|				КОГДА _ТаблицаОтчета.СтадияОбесценения = ЗНАЧЕНИЕ(Перечисление.СтадииОбесценения.Стадия1)
	|					ТОГДА ""1""
	|				КОГДА _ТаблицаОтчета.СтадияОбесценения = ЗНАЧЕНИЕ(Перечисление.СтадииОбесценения.Стадия2)
	|					ТОГДА ""2""
	|				КОГДА _ТаблицаОтчета.СтадияОбесценения = ЗНАЧЕНИЕ(Перечисление.СтадииОбесценения.Стадия3)
	|					ТОГДА ""3""
	|			КОНЕЦ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Раздел,
	|	РодительНомерСтроки,
	|	НомерСтроки,
	|	Актив
	|ИТОГИ
	|	СУММА(СуммаРейтингА),
	|	СУММА(СуммаРейтингБ),
	|	СУММА(СуммаРейтингЦ),
	|	СУММА(СуммаРейтингД),
	|	СУММА(СуммаБезРейтинга)
	|ПО
	|	Раздел,
	|	РодительНомерСтроки,
	|	НомерСтроки
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Возврат Запрос.Выполнить();
	
КонецФункции 

Процедура ДобавитьСтрокуВРасшифровкуНастроек(РасшифровкаНастроек, НастройкаОтчета, ЗначениеНастройки, СтрокаОтчета, ВидДепозита = "")
	
	СтрокаРасшифровки = РасшифровкаНастроек.Добавить();
	СтрокаРасшифровки.НастройкаОтчета = НастройкаОтчета;
	СтрокаРасшифровки.ЗначениеНастройки = ЗначениеНастройки;
	СтрокаРасшифровки.ВидДепозита = ВидДепозита;
	СтрокаРасшифровки.СтрокаОтчета = СтрокаОтчета;
	
	
КонецПроцедуры

Функция ПолучитьПараметрыПримечания(Код, ТаблицаПримечаний) 
	
	Результат = Новый Структура;
	
	ИскомаяСтрока = ТаблицаПримечаний.Найти(Код, "Код");
	Если ИскомаяСтрока <> Неопределено Тогда 
		Результат.Вставить("НомерПримечания", ИскомаяСтрока.НомерПримечания);
		Результат.Вставить("Наименование", ИскомаяСтрока.Наименование);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции   

Функция ПолучитьНаименованиеСтроки(ТаблицаПоказателей, НомерСтроки)
	
	ИскомаяСтрока = ТаблицаПоказателей.Найти(НомерСтроки, "Код");
	Если ИскомаяСтрока <> Неопределено Тогда 
		Возврат ИскомаяСтрока.Наименование; 
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Процедура СформироватьОтчет(ДокументРезультат, НастройкиОтчета) Экспорт
	
	Перем РасшифровкаНастроек;
	
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СформироватьОтчет()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
	Механизм,
	ПараметрыВыполненияДляСбораСтатистики.Хранилище,
	ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДокументРезультат.Очистить();
	
	Макет = ПолучитьМакет("Отчет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтадияОбесценения = Макет.ПолучитьОбласть("СтадияОбесценения");  
	ОбластьРодитель = Макет.ПолучитьОбласть("Родитель");
	ОбластьПоказатель = Макет.ПолучитьОбласть("Показатель");
	ОбластьАктив = Макет.ПолучитьОбласть("Актив");
	
	ВидДеятельности = НастройкиОтчета.ВидДеятельностиОрганизации.Ключ;
	ТаблицаПоказателей = ПолучитьТаблицуПоказателей(ВидДеятельности);
	ТаблицаПримечаний = ПолучитьТаблицуПримечаний(ВидДеятельности); 
	
	//шапка
	НаименованияКлиента = РаботаСОтчетами.ПолноеИКраткоеНаименованиеКлиентаДляДокументов(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период);
		
	ОбластьШапка.Параметры.НомерДоговора	= ЭтотОбъект.СчетДоверительногоУправления.НомерДоговора;	
	ОбластьШапка.Параметры.ДатаДоговора		= Формат(ЭтотОбъект.СчетДоверительногоУправления.ДатаЗаключения, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ПериодОтчета 	= Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy");
	
	ОбластьШапка.Параметры.УчредительУправления = НаименованияКлиента.КраткоеНаименование; 
	ОбластьШапка.Параметры.ДоверительныйУправляющий = ЭтотОбъект.Организация;
	
	ДокументРезультат.Вывести(ОбластьШапка); 

	
	РезультатЗапроса = ПолучитьТаблицуРазделаКредитныхРейтингов(НастройкиОтчета, ТаблицаПоказателей, РасшифровкаНастроек, ТаблицаПримечаний);
	
	ВыборкаСтадии = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	Пока ВыборкаСтадии.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтадияОбесценения.Параметры, ВыборкаСтадии);
		ЗаполнитьЗначенияСвойств(ОбластьСтадияОбесценения.Параметры, ПолучитьПараметрыПримечания(ВыборкаСтадии.Раздел, ТаблицаПримечаний));
		ДокументРезультат.Вывести(ОбластьСтадияОбесценения);     
		
		ДокументРезультат.НачатьГруппуСтрок(, Ложь);
		
		ВыборкаРодитель = ВыборкаСтадии.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		Пока ВыборкаРодитель.Следующий() Цикл    
			ЗаполнитьЗначенияСвойств(ОбластьРодитель.Параметры, ВыборкаРодитель); 
			ОбластьРодитель.Параметры.РодительНаименование = ПолучитьНаименованиеСтроки(ТаблицаПоказателей, ВыборкаРодитель.РодительНомерСтроки); 
			ДокументРезультат.Вывести(ОбластьРодитель); 
			
			ВыборкаПоказатель = ВыборкаРодитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоказатель.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ОбластьПоказатель.Параметры, ВыборкаПоказатель); 
				ОбластьПоказатель.Параметры.Наименование = ПолучитьНаименованиеСтроки(ТаблицаПоказателей, ВыборкаПоказатель.НомерСтроки); 
				ДокументРезультат.Вывести(ОбластьПоказатель);
				
				ДокументРезультат.НачатьГруппуСтрок(, Ложь);
				Выборка = ВыборкаПоказатель.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Пока Выборка.Следующий() Цикл 
					ЗаполнитьЗначенияСвойств(ОбластьАктив.Параметры, Выборка);  
					ДокументРезультат.Вывести(ОбластьАктив);
				КонецЦикла;
				ДокументРезультат.ЗакончитьГруппуСтрок();
			КонецЦикла; 
		КонецЦикла;
		ДокументРезультат.ЗакончитьГруппуСтрок();
	КонецЦикла;
	
	// расшифровка настроек 
	ОбластьСправкаШапка = Макет.ПолучитьОбласть("СправкаШапка");
	ОбластьСправкаНастройка = Макет.ПолучитьОбласть("СправкаНастройка"); 
	
	ДокументРезультат.Вывести(ОбластьСправкаШапка);
	Для Каждого СтрокаРасшифровка из РасшифровкаНастроек Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСправкаНастройка.Параметры,СтрокаРасшифровка);
		ДокументРезультат.Вывести(ОбластьСправкаНастройка);
	КонецЦикла;
	
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
